function Z=Gl_PRM
Nl=2;
Ns=5;                % Количество скважин
T=2*365;            % Период разработки.
dt=0;                % Шаг по времени % если 0- то динамический шаг
Ta=T;
ndt=1;

%% ГДМ параметры
as=[2,2,1];                             % Фазовые в порах  w-o-g
aw=[0.1,1,10];                          % Крайняя точка фазовой в порах w-o-g
 
ts=[2,2,1];                             % Фазовые в трещинах  w-o-g
tw=[1,1,10];                            % Крайняя точка фазовой в трещине w-o-g
kms=0*[1,1,1,1]*1e-3;                   % Коэф. для ур-я форгеймера поры-верт.тр. -гор.тр.-двойная ср.

Swr=0.25;                               %Остаточная вода матрица
Sor=0.2625;                             %Остаточная нефть матрица

SwrC=0.25*0;                                 %Остаточная вода трещина
SorC=0.2625*0;                                 %Остаточная нефть трещина

mu=[1,300,0.1,1];                       % Вязкости w-o-g-p
   %С      mu
mup=[0,  mu(1);
     0.002,20]; %вязкость полимера
Ro=[1.04,0.95,0.00066,3,2.7]*1000;      % Плотности вода-нефть-газ-песчаник-глина
zc=[1e-6,1e-5,1e-3,1e-6,1e-6,1e-6];     % Сжимаемость вода-нефть-газ-песчаник-глина-трещ            
Bo=[1,1,0.5,1,1];                       % Объёмные коэффициенты

%% Параметры трещины
dh=0.0005;                              % Раскрытость верт. дискретной трещины
hg=0.0005;                             % Раскрытость гор. дискретной трещины

Kc=1e+4;                                % Проницаемость дискретной трещины
Kg=1e+2;                                % Проницаемость горизонтальной трещины
Kd=1e+0;                                % Проницаемость двойной среды 

%% Тепловые параметры 
lam=[0.65,0.13,0.06,0.5,0.8]*3600*24;    % Коэф. Теплопроводности
Cp=[4.2,1.9,2.22,0.75,0.75]*1000;        % Теплоёмкости
%Cp=[4.2,4.2,2.22,0.75,0.75]*1000;       % Теплоёмкости


%% Запись в структуру
Z.Nl=Nl;
Z.as=as;
Z.aw=[aw,Swr,Sor];
Z.ts=ts;
Z.tw=[tw,SwrC,SorC];
Z.mu=mu;
Z.Ns=Ns;
Z.Ta=Ta;
Z.dt=dt;
Z.ndt=ndt;
Z.Ro=Ro;
Z.lam=lam;
Z.Cp=Cp;
Z.dh=dh;
Z.Hg=hg;
Z.Kc=Kc;
Z.Kg=Kg;
Z.Kd=Kd;
Z.zc=zc;
Z.Bo=Bo;
Z.mup=mup;
Z.kms=kms;


%% Символьный
syms Sw
SW=(Sw-Swr)./(1-Sor-Swr);
ko=(1-SW).^as(2);
kw=aw(1)*SW.^as(1);

gam=mu(1)/mu(2);

f=kw/(gam*ko+kw);
F=diff(f,Sw);

dS=Swr:0.001:(1-Sor);
fn=(subs(f,dS)-subs(f,Swr))./(dS-Swr);

fm=max(eval(fn));%
fn=eval(fn);
[r,c]=find(fm==fn);

Sc=dS(c);
Fc=eval(subs(F,Sc));

SW=(Sw-SwrC)./(1-SorC-SwrC);
kot=(1-SW).^ts(2);
kwt=tw(1)*SW.^ts(1);

f=kwt/(gam*kot+kwt);
F=diff(f,Sw);

ds=0.001;
dS=SwrC:ds:(1-SorC);
fn=(subs(f,dS)-subs(f,SwrC))./(dS-SwrC);
fm=max(eval(fn));%
fn=eval(fn);

[r,c]=find(fm==fn);
Sc2=dS(c(1));

if Sc2==ds
    Sc2=mu(1)/mu(2)*tw(2)/tw(1);
    Fc2=eval(subs(F,Sc2));
else
    Fc2=eval(subs(F,Sc2));
end;

Z.Fc=Fc;
Z.Sc=Sc;
Z.Fc2=Fc2;
Z.Sc2=Sc2;
